#include "AuthorList.hpp"

/*================================================================================*/
/*================================= Конструкторы =================================*/
/*================================================================================*/\

AuthorList::AuthorList(const std::set<Author>& authors) : Authors(authors){}

AuthorList::AuthorList(const AuthorList & obj)
{
    Authors = obj.Authors;
}

/*================================================================================*/
/*============================= Метод вывода в поток =============================*/
/*================================================================================*/

void AuthorList::output(std::ostream& out)
{
    for (const auto& i : Authors)
    {
        out << i << ' ';
    }
}

/*================================================================================*/
/*====================== Методы добавления и удаления автора =====================*/
/*================================================================================*/

std::set<Author> AuthorList::getAuthors() const
{
    return Authors;
}

void AuthorList::addAuthor(const Author &author)
{ 
    Authors.insert(author);
}

void AuthorList::removeAuthor(const Author& author) 
{
    Authors.erase(author);
}

/*================================================================================*/
/*====================== Перегрузка оператора вывода в поток =====================*/
/*================================================================================*/

std::ostream& operator<<(std::ostream& out, const AuthorList& list)
{
    for ( auto i : list.getAuthors())
    {
        out << i << ", ";
    }
    return out;
}

